Revit 2027 API
ExtendedPropertiesLinkData.IsValidContainerName Method
 Validates that the given name is valid for use as the container name of an extended properties link.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidContainerName(
	string containerName
)
Public Shared Function IsValidContainerName (
	containerName As String
) As Boolean
public:
static bool IsValidContainerName(
	String^ containerName
)
static member IsValidContainerName :
        containerName : string -> bool
Parameters
containerName String
Return Value
Boolean
 True if the name can be used as the container name of an extended properties link. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A valid name must not contain non-printable characters, characters invalid for a path, and must contain at least one non-whitespace character.
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace